// All the ANSI glyphs / chars
pub const GLYPHS: [char; 253] = ['☺', '☻', '♥', '♦', '♣', '♠', '•', '◘', '○', '◙', '♂', '♀', '♪', '♫', '☼', '►', '◄', '↕', '‼', '¶', '§', '▬', '↨', '↑', '↓', '→', '←', '∟', '↔', '▲', '▼', '!', '"', '#', '$', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.', '/', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', ':', ';', '<', '=', '>', '?', '@', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '[', '\\', ']', '^', '_', '`', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '{', '|', '}', '~', '⌂', 'Ç', 'ü', 'é', 'â', 'ä', 'à', 'å', 'ç', 'ê', 'ë', 'è', 'ï', 'î', 'ì', 'Ä', 'Å', 'É', 'æ', 'Æ', 'ô', 'ö', 'ò', 'û', 'ù', 'ÿ', 'Ö', 'Ü', '¢', '£', '¥', '₧', 'ƒ', 'á', 'í', 'ó', 'ú', 'ñ', 'Ñ', 'ª', 'º', '¿', '⌐', '¬', '½', '¼', '¡', '«', '»', '░', '▒', '▓', '│', '┤', '╡', '╢', '╖', '╕', '╣', '║', '╗', '╝', '╜', '╛', '┐', '└', '┴', '┬', '├', '─', '┼', '╞', '╟', '╚', '╔', '╩', '╦', '╠', '═', '╬', '╧', '╨', '╤', '╥', '╙', '╘', '╒', '╓', '╫', '╪', '┘', '┌', '█', '▄', '▌', '▐', '▀', 'α', 'ß', 'Γ', 'π', 'Σ', 'σ', 'µ', 'τ', 'Φ', 'Θ', 'Ω', 'δ', '∞', 'φ', 'ε', '∩', '≡', '±', '≥', '≤', '⌠', '⌡', '÷', '≈', '°', '∙', '·', '√', 'ⁿ', '²', '■'];

// All the 16 EGA colors
pub mod colors {
	use macroquad::prelude::Color;

	pub const BLACK: Color      = Color { r: 0.00, g: 0.00, b: 0.00, a: 1.00 };
	pub const DARK_GRAY: Color  = Color { r: 0.33, g: 0.33, b: 0.33, a: 1.00 };
	pub const GRAY: Color       = Color { r: 0.66, g: 0.66, b: 0.66, a: 1.00 };
	pub const WHITE: Color      = Color { r: 1.00, g: 1.00, b: 1.00, a: 1.00 };
	pub const DARK_BLUE: Color  = Color { r: 0.00, g: 0.00, b: 0.66, a: 1.00 };
	pub const BLUE: Color       = Color { r: 0.33, g: 0.33, b: 1.00, a: 1.00 };
	pub const DARK_GREEN: Color = Color { r: 0.00, g: 0.66, b: 0.00, a: 1.00 };
	pub const GREEN: Color      = Color { r: 0.33, g: 1.00, b: 0.33, a: 1.00 };
	pub const DARK_TEAL: Color  = Color { r: 0.00, g: 0.66, b: 0.66, a: 1.00 };
	pub const TEAL: Color       = Color { r: 0.33, g: 1.00, b: 1.00, a: 1.00 };
	pub const DARK_RED: Color   = Color { r: 0.66, g: 0.00, b: 0.00, a: 1.00 };
	pub const RED: Color        = Color { r: 1.00, g: 0.33, b: 0.33, a: 1.00 };
	pub const DARK_PINK: Color  = Color { r: 0.66, g: 0.00, b: 0.66, a: 1.00 };
	pub const PINK: Color       = Color { r: 1.00, g: 0.33, b: 1.00, a: 1.00 };
	pub const ORANGE: Color     = Color { r: 0.66, g: 0.33, b: 0.00, a: 1.00 };
	pub const YELLOW: Color     = Color { r: 1.00, g: 1.00, b: 0.33, a: 1.00 };
}